06/10/2021
------------
Άσκηση :Να γραφεί script σε R που να επιλύσει μια εξίσωση δευτέρου ή πρώτου βαθμού

Άσκηση :Να γραφεί script σε R που να βρίσκει τις ρίζες της συνάρτησης f(x)=3*X^4-2*x^3+2*x-1
στο διάστημα [-10^6,10^6] με βήμα 0,5. Ως ρίζα να θεωρείστε f(x)<=0.05

Άσκηση : να δημιουργήσετε ένα διάνυσμα με  150 τυχαίους θετικούς ακεραίους στο διάστημα 
[1,20] με επανατοποθέτηση. Να δημιουργήσετε τον πίνακα συχνοτήτων χωρίς την χρήση της εντολής table

Άσκηση :Να γραφεί script με συνάρτηση η οποία να δέχεται έναν θετικό ακέραιο και να εκτυπώνει την τιμή του παραγοντικού του

Άσκηση :Να δημιουργήσετε έναν πίνακα με τυχαίους 100 θετικούς ακέραιους αριθμούς (25Χ4) από ομοιόμορφη κατανομή στο διάστημα[1,3] με επανατοποθέτηση.
Στην συνέχεια σε κάθε στοιχείο του πίνακα να ανα στήλη να δημιουργήσετε τον πίνακα σχετικών συχνοτήτων με χρήση της εντολής apply

Άσκηση :Να δημιουργήσετε ένα πλαίσιο δεδομένων 4 γραμμών και 5 στηλών με πραγματικούς αριθμούς(rnorm) και σε 7 τυχαίες θέσεις να τοποθετήσετε ελλιπείς τιμές κάνοντας χρήση
της συνάρτησης sample.Να συμπληρωθούν οι ελλιπείς τιμές με τον συνολικό μέσο όρο της δομής


Άσκηση.: Να γραφεί πρόγραμμα σε R που να παράγει από ομοιόμορφη κατανομή  10000 τυχαίους ακεραίους στο διάστημα [1,100] και να τους τοποθετήσει σε έναν τετραγωνικό πίνακα 100Χ100. Να βρεθούν τα βασικά περιγραφικά στατιστικά του πίνακα συνολικά, κατά γραμμή και κατά στήλη με την χρήση απλών εντολών (όχι χρήση βρόχων κλπ).

Άσκηση: Να εισάγεται στο περιβάλλον του Rstudio το αρχείο recode.xlsx Στην συνέχεια για εφαρμόστε συμπλήρωση των ελλιπών στοιχείων με την χρήση κατάλληλων τεχνικών (κατηγορικές μεταβλητές->συχνότητες) (ποσοτικές μεταβλητές->μέση τιμή). Επίσης επί των αρχικών δεδομένων να κάνετε αφαίρεση των γραμμών που έχουν ελλιπές τιμές

Άσκηση: από το σετ δεδομένων airquality να αφαιρέσετε τις γραμμές που περιέχουν ελλιπείς τιμές. Στην συνέχεια για τις εναπομείναντες γραμμές να επιλέξετε μόνο εκείνες τις γραμμές οι οποίες που είχαν θερμοκρασία πάνω από 65F.

Άσκηση: από το σετ δεδομένων mtcars να ταξινομήσετε κατά φθίνουσα σειρά τις γραμμές ως προς την στήλη της ιπποδύναμης. Στα αποτελέσματα να συμπεριλαμβάνονται μόνο οι πρώτες 3 στήλες.

Άσκηση: Στόχος αυτής της άσκησης είναι η περαιτέρω εξοικείωση με το πακέτο dplyr. Υλοποιείστε στην R τα παρακάτω ερωτήματα, χρησιμοποιώντας όπου χρειάζεται και μπορούν να χρησιμοποιηθούν οι έτοιμες συναρτήσεις του πακέτου dplyr.
α) Φορτώστε το έτοιμο σύνολο δεδομένων mtcars, που παρέχει η R, και μετατρέψτε το, ώστε η κλάση του να είναι tbl_df.
β) Επιλέξτε τις στήλες mpg, cyl και wt.
γ) Φιλτράρετε το επιλεγμένο υποσύνολο και κρατήστε μόνο τις εγγραφές με cyl ίσο με 8. Έπειτα ταξινομήστε τις εγγραφές κατά αύξουσα σειρά ως προς το mpg και κατά φθίνουσα ως προ το wt.








